src/cf/InformationRegisters/уатСвязанныеДокументыЭПД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>уатСвязанныеДокументыЭПД</Name>
			<Comment>(уат)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>QR</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЭПД</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЭлектронныйЗаказНаряд</v8:Type>
						<v8:Type>cfg:DocumentRef.ЭлектронныйПутевойЛист</v8:Type>
						<v8:Type>cfg:DocumentRef.ЭлектронныйЗаказЗаявка</v8:Type>
						<v8:Type>cfg:DocumentRef.ЭлектроннаяТранспортнаяНакладная</v8:Type>
						<v8:Type>cfg:DocumentRef.ЭлектроннаяСопроводительнаяВедомость</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказНаТС</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уатЗаказГрузоотправителя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Рейс</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уатМаршрутныйЛист</v8:Type>
						<v8:Type>cfg:DocumentRef.уатПутевойЛист</v8:Type>
						<v8:Type>cfg:DocumentRef.уатЗаказПеревозчику_уэ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/СостоянияПоОбъектамУчетаЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СостоянияПоОбъектамУчетаЭДО</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СостояниеЭДО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияДокументовЭДО</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьЭлектронныйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЭлектронныйДокументВходящийЭДО</v8:Type>
						<v8:Type>cfg:DocumentRef.ЭлектронныйДокументИсходящийЭДО</v8:Type>
						<v8:Type>cfg:CatalogRef.СообщениеЭДОПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьДействияСНашейСтороны</Name>
					<Comment>Признак необходимости выполнения какого-либо действия с ЭД с нашей стороны</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.УдалитьСводныеСостоянияЭДО</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьДействияСоСтороныДругогоУчастника</Name>
					<Comment>Признак ожидания выполнения какого-либо действия со стороны другого участника ЭД</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.УдалитьСводныеСостоянияЭДО</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеСостояния</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УчастникЭДО</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СсылкаНаОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованияЭлектронныхДокументовЭДО</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/уатТекущееСостояниеЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>уатТекущееСостояниеЭДО</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СостояниеЭДО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияДокументовЭДО</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПредставлениеСостояния</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеЭПД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭПД</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЭлектронныйЗаказНаряд</v8:Type>
						<v8:Type>cfg:DocumentRef.ЭлектроннаяТранспортнаяНакладная</v8:Type>
						<v8:Type>cfg:DocumentRef.ЭлектроннаяСопроводительнаяВедомость</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДокументПеревозки</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уатЗаказГрузоотправителя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/уатСвязанныеДокументыЭПД/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	СтарыйНабор = РегистрыСведений.уатСвязанныеДокументыЭПД.СоздатьНаборЗаписей();
	Для Каждого ЭлементОтбора Из Отбор Цикл
		Если ЭлементОтбора.Использование Тогда
			СтарыйНабор.Отбор[ЭлементОтбора.Имя].Установить(ЭлементОтбора.Значение);
		КонецЕсли;
	КонецЦикла;
	СтарыйНабор.Прочитать();
	
	ДокументыВНаборе = Новый Массив(); 
	СоответвиеЭПД    = Новый Соответствие();
	Для Каждого СтрокаНабора Из ЭтотОбъект Цикл  
		Если ДокументыВНаборе.Найти(СтрокаНабора.ЗаказНаТС) = Неопределено Тогда
			ДокументыВНаборе.Добавить(СтрокаНабора.ЗаказНаТС); 
		КонецЕсли;
	КонецЦикла; 
	
	Для Каждого СтрокаНабора Из СтарыйНабор Цикл  
		Если ДокументыВНаборе.Найти(СтрокаНабора.ЗаказНаТС) = Неопределено Тогда
			ДокументыВНаборе.Добавить(СтрокаНабора.ЗаказНаТС); 
		КонецЕсли;
		Если ЭтотОбъект.Количество() = 0 Тогда
			// Провери что нет других записей  
			УдалитьЗаказ = Ложь;
			УдалитьРейс  = Ложь;
			
			НаборЗаписей = РегистрыСведений.уатСвязанныеДокументыЭПД.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ЭПД.Установить(СтрокаНабора.ЭПД);
			НаборЗаписей.Отбор.ЗаказНаТС.Установить(СтрокаНабора.ЗаказНаТС);
			НаборЗаписей.Прочитать();
			Если НаборЗаписей.Количество() <= 1 Тогда
				УдалитьЗаказ = Истина;
			Конецесли; 
			
			НаборЗаписей = РегистрыСведений.уатСвязанныеДокументыЭПД.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ЭПД.Установить(СтрокаНабора.ЭПД);
			НаборЗаписей.Отбор.Рейс.Установить(СтрокаНабора.Рейс);
			НаборЗаписей.Прочитать();
			Если НаборЗаписей.Количество() <= 1 Тогда
				УдалитьРейс = Истина;
			Конецесли;
			
			Если УдалитьЗаказ
				ИЛИ УдалитьРейс Тогда
				
				ДокОбъект = СоответвиеЭПД.Получить(СтрокаНабора.ЭПД);
				Если ДокОбъект = Неопределено 
					И ЗначениеЗаполнено(СтрокаНабора.ЭПД) Тогда 
					ДокОбъект = СтрокаНабора.ЭПД.ПолучитьОбъект();
				КонецЕсли;
				Если НЕ ЗначениеЗаполнено(СтрокаНабора.ЭПД) 
					ИЛИ ДокОбъект = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				Если УдалитьЗаказ Тогда
					ТекСтрокиЗаказ = ДокОбъект.ДокументыОснования.НайтиСтроки(
					Новый Структура("ДокументОснование", СтрокаНабора.ЗаказНаТС));
					Если ТекСтрокиЗаказ.Количество() <> 0 Тогда 
						Для Каждого ТекСтрока Из ТекСтрокиЗаказ Цикл 
							ДокОбъект.ДокументыОснования.Удалить(ТекСтрока);
						КонецЦикла;
						СоответвиеЭПД.Вставить(СтрокаНабора.ЭПД, ДокОбъект);
					КонецЕсли;
				Конецесли;
				
				Если УдалитьРейс Тогда
					ТекСтрокиРейс = ДокОбъект.ДокументыОснования.НайтиСтроки(
					Новый Структура("ДокументОснование", СтрокаНабора.Рейс));
					Если ТекСтрокиРейс.Количество() <> 0 Тогда 
						Для Каждого ТекСтрока Из ТекСтрокиРейс Цикл 
							ДокОбъект.ДокументыОснования.Удалить(ТекСтрока);
						КонецЦикла;
						СоответвиеЭПД.Вставить(СтрокаНабора.ЭПД, ДокОбъект);
					КонецЕсли;
				Конецесли;
			Конецесли;
		КонецЕсли;
	КонецЦикла; 
	
	Для Каждого ТекСтрока Из СоответвиеЭПД Цикл
		Попытка    
			ТекСтрока.Значение.ДополнительныеСвойства.Вставить("НеПересчитывать", Истина);
			ТекСтрока.Значение.Записать(); 
		Исключение
		КонецПопытки;
	КонецЦикла;

	ДополнительныеСвойства.Вставить("ДокументыВНаборе", ДокументыВНаборе);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат; 
	КонецЕсли;
	
	ДокументыВНаборе = Новый ТаблицаЗначений();
	ДокументыВНаборе.Колонки.Добавить("Документ",
		Новый ОписаниеТипов("ДокументСсылка.уатЗаказГрузоотправителя"));
	
	Для Каждого ТекДокумент Из ДополнительныеСвойства.ДокументыВНаборе Цикл
		НоваяСтрока = ДокументыВНаборе.Добавить();
		НоваяСтрока.Документ = ТекДокумент;
	КонецЦикла;
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ДокументыВНаборе", ДокументыВНаборе);

	Запрос.Текст = "ВЫБРАТЬ
	               |	ДокументыВНаборе.Документ КАК Документ
	               |ПОМЕСТИТЬ втДокументыВНаборе
	               |ИЗ
	               |	&ДокументыВНаборе КАК ДокументыВНаборе
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	втДокументыВНаборе.Документ КАК Документ,
	               |	ЕСТЬNULL(уатСвязанныеДокументыЭПД.ЭПД, """") КАК ЭПД,
	               |	ЕСТЬNULL(СостоянияПоОбъектамУчетаЭДО.ПредставлениеСостояния, """") КАК ПредставлениеСостояния,
	               |	СостоянияПоОбъектамУчетаЭДО.СостояниеЭДО КАК СостояниеЭДО
	               |ИЗ
	               |	втДокументыВНаборе КАК втДокументыВНаборе
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уатСвязанныеДокументыЭПД КАК уатСвязанныеДокументыЭПД
	               |		ПО (втДокументыВНаборе.Документ = уатСвязанныеДокументыЭПД.ЗаказНаТС
	               |				ИЛИ втДокументыВНаборе.Документ = уатСвязанныеДокументыЭПД.Рейс)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияПоОбъектамУчетаЭДО КАК СостоянияПоОбъектамУчетаЭДО
	               |		ПО уатСвязанныеДокументыЭПД.ЭПД = СостоянияПоОбъектамУчетаЭДО.СсылкаНаОбъект";
	Попытка
		
		Основания = Запрос.Выполнить().Выгрузить();
		
		Для Каждого ТекущаяСтрока Из ДокументыВНаборе Цикл
			
			Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.Документ) Тогда
				Продолжить;
			КонецЕсли;
			
			ОтборЭД = Новый Структура("Документ", ТекущаяСтрока.Документ);
			ОснованияЭД = Основания.НайтиСтроки(ОтборЭД);
			
			ПредставлениеЭПД       = "";
			ПредставлениеСостояния = "";
			СостояниеЭДО           = "";
			ЭПД                    = "";
			
			Если ЗначениеЗаполнено(ОснованияЭД) Тогда 
				КоличествоОснований = ОснованияЭД.Количество();
				Если КоличествоОснований = 1 Тогда
					ПредставлениеЭПД = Строка(ОснованияЭД[0].ЭПД);
				Иначе
					ШаблонСтроки = НСтр("ru = ';%1 документ;;%1 документа;%1 документов;%1 документов'; en = ';%1 document;;%1 document;%1 documents;%1 documents'");
					ПредставлениеЭПД = СтрокаСЧислом(ШаблонСтроки, КоличествоОснований, ВидЧисловогоЗначения.Количественное);
				КонецЕсли;
				
				Если КоличествоОснований > 0 Тогда  
					ПредставлениеСостояния = ОснованияЭД[0].ПредставлениеСостояния;
					СостояниеЭДО           = ОснованияЭД[0].СостояниеЭДО;
					ЭПД                    = ОснованияЭД[0].ЭПД;
				КонецЕсли;
			КонецЕсли;
		
			НаборЗаписей = РегистрыСведений.уатТекущееСостояниеЭДО.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ДокументПеревозки.Установить(ТекущаяСтрока.Документ); 
			НаборЗаписей.Прочитать(); 
			
			Если НаборЗаписей.Количество() > 0 Тогда 
				Запись = НаборЗаписей[0];
				Если ПредставлениеЭПД = "" Тогда
					НаборЗаписей.Удалить(Запись);
					Продолжить;
				КонецЕсли;
			Иначе
				Запись = НаборЗаписей.Добавить();
				Запись.ДокументПеревозки = ТекущаяСтрока.Документ;
				Если ПредставлениеЭПД = "" Тогда
					Продолжить;
				КонецЕсли;
				Запись.ПредставлениеСостояния = ПредставлениеСостояния;
				Запись.СостояниеЭДО           = СостояниеЭДО;
				Запись.ЭПД                    = ЭПД;

			КонецЕсли;
			Запись.ПредставлениеЭПД = ПредставлениеЭПД;
			НаборЗаписей.Записать();
		КонецЦикла;
	Исключение
		Информация = ИнформацияОбОшибке();
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
